In [26]:
persondict = {'person':['Bob','Alice','Steve'],'age':[32,24,64],'weight':[128,86,95]}

In [27]:
import pandas as pd
persontable = pd.DataFrame(persondict, columns=['person','age','weight'])

In [28]:
persontable

  person  age  weight
0    Bob   32     128
1  Alice   24      86
2  Steve   64      95

In [29]:
persontable=persontable.set_index('person')

In [30]:
persontable

        age  weight
person
Bob      32     128
Alice    24      86
Steve    64      95

In [31]:
persontable.shape

(3, 2)

In [32]:
persontable.dtypes

age       int64
weight    int64
dtype: object

In [33]:
result = persontable.stack()
result

person
Bob     age        32
        weight    128
Alice   age        24
        weight     86
Steve   age        64
        weight     95
dtype: int64

In [34]:
result.index

MultiIndex([(  'Bob',    'age'),
            (  'Bob', 'weight'),
            ('Alice',    'age'),
            ('Alice', 'weight'),
            ('Steve',    'age'),
            ('Steve', 'weight')],
           names=['person', None])

In [35]:
result.shape

(6,)

In [36]:
#persontall = result.reset_index()

In [39]:
persontall

  person attribute  weight
0    Bob       age      32
1    Bob    weight     128
2  Alice       age      24
3  Alice    weight      86
4  Steve       age      64
5  Steve    weight      95

In [43]:
persontall.columns=['person','attribute','value']

In [44]:
persontall

  person attribute  value
0    Bob       age     32
1    Bob    weight    128
2  Alice       age     24
3  Alice    weight     86
4  Steve       age     64
5  Steve    weight     95

In [22]:
result.unstack()

        age  weight
person
Bob      32     128
Alice    24      86
Steve    64      95

In [45]:
persontall.pivot('person','attribute','value')

attribute  age  weight
person
Alice       24      86
Bob         32     128
Steve       64      95